src/cf/InformationRegisters/СкидкиТорговыхПредложенийВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СкидкиТорговыхПредложенийВидыЦен</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговоеПредложение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговоеПредложение</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидыЦен</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидыЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СкидкиТорговыхПредложенийВидыЦен/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСкидкиТорговыхПредложений(Параметры) Экспорт
	
	Если Параметры.ТорговоеПредложение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТорговоеПредложение = Параметры.ТорговоеПредложение;
	Опт = Параметры.Опт;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкидкиТорговыхПредложенийВидыЦен.ТорговоеПредложение КАК ТорговоеПредложение,
	|	СкидкиТорговыхПредложенийВидыЦен.Количество КАК Количество,
	|	СкидкиТорговыхПредложенийВидыЦен.ВидыЦен КАК ВидыЦен
	|ИЗ
	|	РегистрСведений.СкидкиТорговыхПредложенийВидыЦен КАК СкидкиТорговыхПредложенийВидыЦен
	|ГДЕ
	|	СкидкиТорговыхПредложенийВидыЦен.ТорговоеПредложение = &ТорговоеПредложение
	|	И СкидкиТорговыхПредложенийВидыЦен.Количество = 1";
	Запрос.УстановитьПараметр("ТорговоеПредложение", ТорговоеПредложение);
	
	Если Опт Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"И СкидкиТорговыхПредложенийВидыЦен.Количество = 1", 
			"И СкидкиТорговыхПредложенийВидыЦен.Количество <> 1");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура ДобавитьСкидкуТорговогоПредложения(ТорговоеПредложение, Скидка, Отказ, Удалить) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТорговоеПредложение.Установить(ТорговоеПредложение);
		НаборЗаписей.Отбор.ВидыЦен.Установить(Скидка);
		
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(НаборЗаписей);
		
		Если Удалить Тогда
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() Тогда
			
			ТекстСообщения = НСтр("ru = 'Выбранное значение скидки уже используется в скидках за опт'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Скидка", , Отказ);
			ОтменитьТранзакцию();
			Возврат;
			
		КонецЕсли;
		
		СтрокаЗаписи = НаборЗаписей.Добавить();
		СтрокаЗаписи.ТорговоеПредложение = ТорговоеПредложение;
		СтрокаЗаписи.ВидыЦен = Скидка;
		СтрокаЗаписи.Количество = 1;
		
		НаборЗаписей.Записать(Ложь);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Торговые предложения.Добавление скидки торгового предложения.'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,, 
			"СкидкиТорговыхПредложенийВидыЦен.ДобавитьСкидкуТорговогоПредложения", 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
